In [1]:
import numpy as np
import pandas as pd

In [3]:
df = pd.read_csv("spam.csv", encoding="latin-1")

In [5]:
df.sample(5)

,v1,v2,Unnamed: 2,Unnamed: 3,Unnamed: 4
1898,ham,Wat would u like 4 ur birthday?,NaN,NaN,NaN
5194,ham,Ok... Take ur time n enjoy ur dinner...,NaN,NaN,NaN
3006,ham,Ah you see. You have to be in the lingo. I wil...,NaN,NaN,NaN
927,ham,K:)i will give my kvb acc details:),NaN,NaN,NaN
11,spam,"SIX chances to win CASH! From 100 to 20,000 po...",NaN,NaN,NaN

In [6]:
df.shape

(5572, 5)

# DATA CLEANING

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5572 entries, 0 to 5571
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   v1          5572 non-null   object
 1   v2          5572 non-null   object
 2   Unnamed: 2  50 non-null     object
 3   Unnamed: 3  12 non-null     object
 4   Unnamed: 4  6 non-null      object
dtypes: object(5)
memory usage: 217.8+ KB

In [9]:
df.drop(columns=['Unnamed: 2','Unnamed: 3','Unnamed: 4'],inplace=True)

In [10]:
df.sample(5)

        v1                                                 v2
783   spam  You have an important customer service announc...
5245   ham  Thank you princess! I want to see your nice ju...
3333   ham  That's fine, have him give me a call if he kno...
4029   ham                       Cool, I'll text you in a few
25     ham  Just forced myself to eat a slice. I'm really ...

In [11]:
df.rename(columns={'v1':'target','v2':'text'},inplace=True)
df.sample(5)

     target                                               text
4996    ham                       Esplanade lor. Where else...
1206   spam  As a SIM subscriber, you are selected to recei...
5004    ham  Guess which pub im in? Im as happy as a pig in...
3441   spam  Save money on wedding lingerie at www.bridal.p...
1990    ham  HI DARLIN IVE JUST GOT BACK AND I HAD A REALLY...

In [13]:
from sklearn.preprocessing import LabelEncoder
encoder=LabelEncoder()

In [16]:
df['target']=encoder.fit_transform(df['target'])

In [17]:
df.head()

   target                                               text
0       0  Go until jurong point, crazy.. Available only ...
1       0                      Ok lar... Joking wif u oni...
2       1  Free entry in 2 a wkly comp to win FA Cup fina...
3       0  U dun say so early hor... U c already then say...
4       0  Nah I don't think he goes to usf, he lives aro...

In [18]:
df.isnull().sum()

target    0
text      0
dtype: int64

In [19]:
df.duplicated().sum()

np.int64(403)

In [21]:
df=df.drop_duplicates(keep='first')

In [22]:
df.duplicated().sum()

np.int64(0)

In [23]:
df.shape

(5169, 2)